ServiceDesk/src/Tasks/СлужебнаяЗадача/СлужебнаяЗадача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>СлужебнаяЗадача</name>
  <addressing>InformationRegister.АдресацияЗадач</addressing>
  <attributes>
    <name>ЗаявкаПользователя</name>
    <type>
      <types>DocumentRef.ЗаявкаПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Срок к которому необходимо выполнить задачу</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <comment>Исполнитель из заявки пользователя</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнительЗадачи</name>
    <comment>Тот кто реально выполнил задачу</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <comment>срок к которому необходимо выполнить заявку</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <addressingAttributes>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

ServiceDesk/src/AccumulationRegisters/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтатусыЗаявок</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СостояниеЗаявки</name>
    <type>
      <types>CatalogRef.СостоянияЗаявки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаПользователя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СостояниеЗаявкиСтарое</name>
    <type>
      <types>CatalogRef.СостоянияЗаявки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ServiceDesk/src/Documents/ЗаявкаПользователя/ЗаявкаПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаПользователя</name>
  <basedOn>Document.ЗаявкаПользователя</basedOn>
  <registerRecords>AccumulationRegister.ВыполненыеЗаявки</registerRecords>
  <attributes>
    <name>Архитектор1</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Архитектор2</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>База1С</name>
    <type>
      <types>CatalogRef.БазыДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесНаправление</name>
    <type>
      <types>EnumRef.БизнесНаправления</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.СтепениВажностиЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполненияФакт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаКратко</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Контроллер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Релиз</name>
    <type>
      <types>CatalogRef.Релизы</types>
    </type>
  </attributes>
  <attributes>
    <name>РелизОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаявки</name>
    <type>
      <types>CatalogRef.СостоянияЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>Тестировщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Трудоёмкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапПроекта</name>
    <type>
      <types>CatalogRef.ЭтапыПроекта</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВложенныеФайлы</name>
    <attributes>
      <name>ИмяФайла</name>
      <comment>Имя файла</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИндексКартинки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Хранилище</name>
      <comment>Хранилище</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Наблюдатель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ServiceDesk/src/Catalogs/СостоянияЗаявки/СостоянияЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияЗаявки</name>
  <predefined>
    <items>
      <name>ВОжидании</name>
      <description>В ожидании</description>
    </items>
    <items>
      <name>ВРаботе</name>
      <description>В работе</description>
    </items>
    <items>
      <name>Выполнена</name>
      <description>Выполнена</description>
    </items>
    <items>
      <name>Закрыта</name>
      <description>Закрыта</description>
    </items>
    <items>
      <name>Зарегистрирована</name>
      <description>Зарегистрирована</description>
    </items>
    <items>
      <name>НаКонтроле</name>
      <description>На контроле</description>
    </items>
    <items>
      <name>НаПроверке</name>
      <description>На проверке</description>
    </items>
    <items>
      <name>НаСогласовании</name>
      <description>На согласовании</description>
    </items>
    <items>
      <name>ОжиданиеОтвета</name>
      <description>Ожидание ответа заказчика</description>
    </items>
    <items>
      <name>ОписаниеПроектногоРешения</name>
      <description>Описание проектного решения</description>
    </items>
    <items>
      <name>Отменена</name>
      <description>Отменена</description>
    </items>
    <items>
      <name>ПереданаКИсполнению</name>
      <description>Передана к исполнению</description>
    </items>
    <items>
      <name>СогласованиеПроектногоРешения1</name>
      <description>Согласование проектного решения</description>
    </items>
    <items>
      <name>СогласованиеПроектногоРешения2</name>
      <description>Согласование проектного решения</description>
    </items>
  </predefined>
  <attributes>
    <name>ИмяУстанавливаемойДаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьЗаполнениеПлановыхПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ServiceDesk/src/Tasks/СлужебнаяЗадача/Forms/ФормаСпискаОперационная/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ТекущийПользователь		= ПараметрыСеанса.ТекущийПользователь;
	ОтображатьДеталиЗаявки	= Истина;

	Элементы.СписокТекущие.АвтоОбновление				= Ложь;
	Элементы.СписокЗарегистрированные.АвтоОбновление	= Ложь;
	Элементы.СписокМоиЗаявки.АвтоОбновление				= Ложь;
	Элементы.СписокНаблюдатель.АвтоОбновление			= Ложь;

	Если РольДоступна("Консультант") Тогда
		Элементы.СписокТекущие.АвтоОбновление	= Истина;
		СписокТекущие.ТекстЗапроса = "ВЫБРАТЬ
									 |	СлужебнаяЗадачаЗадачиПоИсполнителю.ЗаявкаПользователя КАК ЗаявкаПользователя,
									 |	СлужебнаяЗадачаЗадачиПоИсполнителю.СрокИсполнения КАК СрокИсполнения,
									 |	СтатусыЗаявокОстатки.СостояниеЗаявки КАК СостояниеЗаявки,
									 |	ВЫБОР
									 |		КОГДА СлужебнаяЗадачаЗадачиПоИсполнителю.СрокИсполнения < &ДатаОтсечения1
									 |			ТОГДА ИСТИНА
									 |		ИНАЧЕ ЛОЖЬ
									 |	КОНЕЦ КАК Просрочена
									 |ПОМЕСТИТЬ ВТ
									 |ИЗ
									 |	Задача.СлужебнаяЗадача.ЗадачиПоИсполнителю КАК СлужебнаяЗадачаЗадачиПоИсполнителю
									 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтатусыЗаявок.Остатки КАК СтатусыЗаявокОстатки
									 |		ПО СлужебнаяЗадачаЗадачиПоИсполнителю.ЗаявкаПользователя = СтатусыЗаявокОстатки.Заявка
									 |ГДЕ
									 |	НЕ СлужебнаяЗадачаЗадачиПоИсполнителю.Выполнена
									 |	И НЕ СлужебнаяЗадачаЗадачиПоИсполнителю.ПометкаУдаления
									 |	И СтатусыЗаявокОстатки.СостояниеЗаявки <> ЗНАЧЕНИЕ(Справочник.СостоянияЗаявки.Зарегистрирована)
									 |
									 |ОБЪЕДИНИТЬ ВСЕ
									 |
									 |ВЫБРАТЬ
									 |	СлужебнаяЗадача.ЗаявкаПользователя,
									 |	СлужебнаяЗадача.СрокИсполнения,
									 |	СтатусыЗаявокОстатки.СостояниеЗаявки,
									 |	ВЫБОР
									 |		КОГДА СлужебнаяЗадача.СрокИсполнения < &ДатаОтсечения1
									 |			ТОГДА ИСТИНА
									 |		ИНАЧЕ ЛОЖЬ
									 |	КОНЕЦ
									 |ИЗ
									 |	Задача.СлужебнаяЗадача КАК СлужебнаяЗадача
									 |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтатусыЗаявок.Остатки КАК СтатусыЗаявокОстатки
									 |		ПО СлужебнаяЗадача.ЗаявкаПользователя = СтатусыЗаявокОстатки.Заявка
									 |ГДЕ
									 |	НЕ СлужебнаяЗадача.Выполнена
									 |	И НЕ СлужебнаяЗадача.ПометкаУдаления
									 |	И (СтатусыЗаявокОстатки.СостояниеЗаявки = ЗНАЧЕНИЕ(Справочник.СостоянияЗаявки.Зарегистрирована)
									 |			ИЛИ СтатусыЗаявокОстатки.СостояниеЗаявки = ЗНАЧЕНИЕ(Справочник.СостоянияЗаявки.ОжиданиеОтвета)
									 |				И СтатусыЗаявокОстатки.СостояниеЗаявкиСтарое = ЗНАЧЕНИЕ(Справочник.СостоянияЗаявки.Зарегистрирована))
									 |;
									 |
									 |////////////////////////////////////////////////////////////////////////////////
									 |ВЫБРАТЬ РАЗЛИЧНЫЕ
									 |	пЗаявка.Ссылка КАК Заявка,
									 |	пЗаявка.Важность КАК Важность,
									 |	ВТ.СрокИсполнения КАК СрокИсполнения,
									 |	ВТ.СостояниеЗаявки КАК СостояниеЗаявки,
									 |	пЗаявка.База1С КАК База1С,
									 |	пЗаявка.ВидДеятельности КАК ВидДеятельности,
									 |	ВТ.Просрочена КАК Просрочена,
									 |	пЗаявка.Заказчик КАК Заказчик,
									 |	пЗаявка.Релиз КАК Релиз,
									 |	пЗаявка.Исполнитель КАК Исполнитель,
									 |	пЗаявка.Тестировщик КАК Тестировщик
									 |ИЗ
									 |	ВТ КАК ВТ
									 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаПользователя КАК пЗаявка
									 |		ПО ВТ.ЗаявкаПользователя = пЗаявка.Ссылка";
	ИначеЕсли РольДоступна("Пользователь") Тогда
		Элементы.СписокМоиЗаявки.АвтоОбновление	= Истина;
		Элементы.Страницы.ТекущаяСтраница		= Элементы.ГруппаМоиЗаявки;
		Элементы.Страницы.ОтображениеСтраниц	= ОтображениеСтраницФормы.Нет;
		Элементы.ГруппаМоиЗаявки.Видимость = Истина;
	Иначе
		Элементы.СписокТекущие.АвтоОбновление	= Истина;
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаТекущие;
	КонецЕсли;

	ДатаОтсечения	= НачалоДня(ТекущаяДатаСеанса());
	СписокТекущие.Параметры.УстановитьЗначениеПараметра("ДатаОтсечения1", ДатаОтсечения);

	СписокНаблюдатель.Параметры.УстановитьЗначениеПараметра("Наблюдатель", ТекущийПользователь);

	СписокМоиЗаявки.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы[0].ПравоеЗначение	= ТекущийПользователь;
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)

	Если Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаТекущие Тогда
		Если ДатаОтсечения <> НачалоДня(ТекущаяДата()) Тогда
			ДатаОтсечения	= НачалоДня(ТекущаяДата());
			СписокТекущие.Параметры.УстановитьЗначениеПараметра("ДатаОтсечения1", ДатаОтсечения);
		КонецЕсли;
		Элементы.СписокТекущие.АвтоОбновление				= Истина;
		Элементы.СписокЗарегистрированные.АвтоОбновление	= Ложь;
		Элементы.СписокМоиЗаявки.АвтоОбновление				= Ложь;
		Элементы.СписокНаблюдатель.АвтоОбновление			= Ложь;
		Элементы.СписокТекущие.Обновить();
		СписокТекущиеПриАктивизацииСтроки(Элемент);
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаЗарегистрированные Тогда
		Элементы.СписокТекущие.АвтоОбновление				= Ложь;
		Элементы.СписокЗарегистрированные.АвтоОбновление	= Истина;
		Элементы.СписокМоиЗаявки.АвтоОбновление				= Ложь;
		Элементы.СписокНаблюдатель.АвтоОбновление			= Ложь;
		Элементы.СписокЗарегистрированные.Обновить();
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаМоиЗаявки Тогда
		Элементы.СписокТекущие.АвтоОбновление				= Ложь;
		Элементы.СписокЗарегистрированные.АвтоОбновление	= Ложь;
		Элементы.СписокМоиЗаявки.АвтоОбновление				= Истина;
		Элементы.СписокНаблюдатель.АвтоОбновление			= Ложь;
		Элементы.СписокМоиЗаявки.Обновить();
		СписокМоиЗаявкиПриАктивизацииСтроки(Элемент);
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаНаблюдатель Тогда
		Элементы.СписокТекущие.АвтоОбновление				= Ложь;
		Элементы.СписокЗарегистрированные.АвтоОбновление	= Ложь;
		Элементы.СписокМоиЗаявки.АвтоОбновление				= Ложь;
		Элементы.СписокНаблюдатель.АвтоОбновление			= Истина;
		Элементы.СписокНаблюдатель.Обновить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьHTMLИзЗаявки(Заявка)
	СтруктураОтвета	= ЗаявкаПользователяВызовСервера.ПолучитьHTMLИзЗаявки(Заявка);
	ОписаниеHTML						= СтруктураОтвета.ОписаниеHTML;
	КоличествоКомментариев				= "" + СтруктураОтвета.КоличествоКомментариев;
	ОписаниеРазработчикаHTML			= СтруктураОтвета.ОписаниеРазработчикаHTML;
	КоличествоКомментариевРазработчика	= "" + СтруктураОтвета.КоличествоКомментариевРазработчика;
КонецПроцедуры

&НаКлиенте
Процедура СписокТекущиеПриАктивизацииСтроки(Элемент)
	ТекущиеДанные	= Элементы.СписокТекущие.ТекущиеДанные;
	Если ОтображатьДеталиЗаявки И ТекущиеДанные <> Неопределено И ТекущиеДанные.Свойство("Заявка") Тогда
		ПолучитьHTMLИзЗаявки(ТекущиеДанные.Заявка);
	Иначе
		ОписаниеHTML				= "";
		ОписаниеРазработчикаHTML	= "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокМоиЗаявкиПриАктивизацииСтроки(Элемент)
	ТекущиеДанные	= Элементы.СписокМоиЗаявки.ТекущиеДанные;
	Если ОтображатьДеталиЗаявки И ТекущиеДанные <> Неопределено И ТекущиеДанные.Свойство("Заявка") Тогда
		ПолучитьHTMLИзЗаявки(ТекущиеДанные.Заявка);
	Иначе
		ОписаниеHTML	= "";
		ОписаниеРазработчикаHTML	= "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьОписаниеHTML" Тогда
		Если Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаТекущие Тогда
			Элементы.СписокТекущие.Обновить();
		ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаМоиЗаявки Тогда
			Элементы.СписокМоиЗаявки.Обновить();
		КонецЕсли;
		ТекущиеДанные	= Элементы.СписокТекущие.ТекущиеДанные;
		Если ОтображатьДеталиЗаявки И ТекущиеДанные <> Неопределено И ТекущиеДанные.Свойство("Заявка") И Параметр
			= ТекущиеДанные.Заявка Тогда
			ПолучитьHTMLИзЗаявки(ТекущиеДанные.Заявка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОписаниеДобавить(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = "ОК" Тогда
		ПолучитьHTMLИзЗаявки(ДополнительныеПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура Детали(Команда)
	ОтображатьДеталиЗаявки					= Не ОтображатьДеталиЗаявки;
	Элементы.ГруппаОписание.Видимость		= ОтображатьДеталиЗаявки;
	Элементы.СписокТекущиеДетали.Пометка	= ОтображатьДеталиЗаявки;
КонецПроцедуры
